yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151c8.h
#define CLK_CKDIVR_CKM           CLK_CKDIVR_bit.CKM

#define CLK_CRTCR_RTCSWBSY       CLK_CRTCR_bit.RTCSWBSY
#define CLK_CRTCR_RTCSEL0        CLK_CRTCR_bit.RTCSEL0
#define CLK_CRTCR_RTCSEL1        CLK_CRTCR_bit.RTCSEL1
#define CLK_CRTCR_RTCSEL2        CLK_CRTCR_bit.RTCSEL2
#define CLK_CRTCR_RTCSEL3        CLK_CRTCR_bit.RTCSEL3
#define CLK_CRTCR_RTCDIV0        CLK_CRTCR_bit.RTCDIV0
#define CLK_CRTCR_RTCDIV1        CLK_CRTCR_bit.RTCDIV1
#define CLK_CRTCR_RTCDIV2        CLK_CRTCR_bit.RTCDIV2

#define CLK_ICKCR_HSION          CLK_ICKCR_bit.HSION
#define CLK_ICKCR_HSIRDY         CLK_ICKCR_bit.HSIRDY
#define CLK_ICKCR_LSION          CLK_ICKCR_bit.LSION
#define CLK_ICKCR_LSIRDY         CLK_ICKCR_bit.LSIRDY
#define CLK_ICKCR_SAHALT         CLK_ICKCR_bit.SAHALT
#define CLK_ICKCR_FHWU           CLK_ICKCR_bit.FHWU
#define CLK_ICKCR_BEEPAHALT      CLK_ICKCR_bit.BEEPAHALT

#define CLK_PCKENR1_PCKEN10      CLK_PCKENR1_bit.PCKEN10
#define CLK_PCKENR1_PCKEN11      CLK_PCKENR1_bit.PCKEN11
#define CLK_PCKENR1_PCKEN12      CLK_PCKENR1_bit.PCKEN12
#define CLK_PCKENR1_PCKEN13      CLK_PCKENR1_bit.PCKEN13
#define CLK_PCKENR1_PCKEN14      CLK_PCKENR1_bit.PCKEN14
#define CLK_PCKENR1_PCKEN15      CLK_PCKENR1_bit.PCKEN15
#define CLK_PCKENR1_PCKEN16      CLK_PCKENR1_bit.PCKEN16
#define CLK_PCKENR1_PCKEN17      CLK_PCKENR1_bit.PCKEN17

#define CLK_PCKENR2_PCKEN20      CLK_PCKENR2_bit.PCKEN20
#define CLK_PCKENR2_PCKEN21      CLK_PCKENR2_bit.PCKEN21
#define CLK_PCKENR2_PCKEN22      CLK_PCKENR2_bit.PCKEN22
#define CLK_PCKENR2_PCKEN23      CLK_PCKENR2_bit.PCKEN23
#define CLK_PCKENR2_PCKEN24      CLK_PCKENR2_bit.PCKEN24
#define CLK_PCKENR2_PCKEN25      CLK_PCKENR2_bit.PCKEN25
#define CLK_PCKENR2_PCKEN27      CLK_PCKENR2_bit.PCKEN27

#define CLK_CCOR_CCOSWBSY        CLK_CCOR_bit.CCOSWBSY
#define CLK_CCOR_CCOSEL          CLK_CCOR_bit.CCOSEL
#define CLK_CCOR_CCODIV          CLK_CCOR_bit.CCODIV

#define CLK_ECKCR_HSEON          CLK_ECKCR_bit.HSEON
#define CLK_ECKCR_HSERDY         CLK_ECKCR_bit.HSERDY
#define CLK_ECKCR_LSEON          CLK_ECKCR_bit.LSEON
#define CLK_ECKCR_LSERDY         CLK_ECKCR_bit.LSERDY
#define CLK_ECKCR_HSEBYP         CLK_ECKCR_bit.HSEBYP
#define CLK_ECKCR_LSEBYP         CLK_ECKCR_bit.LSEBYP

#define CLK_SWCR_SWBSY           CLK_SWCR_bit.SWBSY
#define CLK_SWCR_SWEN            CLK_SWCR_bit.SWEN
#define CLK_SWCR_SWIEN           CLK_SWCR_bit.SWIEN
#define CLK_SWCR_SWIF            CLK_SWCR_bit.SWIF

#define CLK_CSSR_CSSEN           CLK_CSSR_bit.CSSEN
#define CLK_CSSR_AUX             CLK_CSSR_bit.AUX
#define CLK_CSSR_CSSDIE          CLK_CSSR_bit.CSSDIE
#define CLK_CSSR_CSSD            CLK_CSSR_bit.CSSD
#define CLK_CSSR_CSSDGON         CLK_CSSR_bit.CSSDGON

#define CLK_CBEEPR_BEEPSWBSY     CLK_CBEEPR_bit.BEEPSWBSY
#define CLK_CBEEPR_CLKBEEPSEL0   CLK_CBEEPR_bit.CLKBEEPSEL0
#define CLK_CBEEPR_CLKBEEPSEL1   CLK_CBEEPR_bit.CLKBEEPSEL1

#define CLK_REGCSR_REGREADY      CLK_REGCSR_bit.REGREADY
#define CLK_REGCSR_REGOFF        CLK_REGCSR_bit.REGOFF
#define CLK_REGCSR_HSIPD         CLK_REGCSR_bit.HSIPD
#define CLK_REGCSR_LSIPD         CLK_REGCSR_bit.LSIPD
#define CLK_REGCSR_HSEPD         CLK_REGCSR_bit.HSEPD
#define CLK_REGCSR_LSEPD         CLK_REGCSR_bit.LSEPD
#define CLK_REGCSR_EEBUSY        CLK_REGCSR_bit.EEBUSY
#define CLK_REGCSR_EEREADY       CLK_REGCSR_bit.EEREADY

#define CLK_PCKENR3_PCKEN30      CLK_PCKENR3_bit.PCKEN30
#define CLK_PCKENR3_PCKEN31      CLK_PCKENR3_bit.PCKEN31
#define CLK_PCKENR3_PCKEN32      CLK_PCKENR3_bit.PCKEN32
#define CLK_PCKENR3_PCKEN33      CLK_PCKENR3_bit.PCKEN33
#define CLK_PCKENR3_PCKEN34      CLK_PCKENR3_bit.PCKEN34
#define CLK_PCKENR3_PCKEN35      CLK_PCKENR3_bit.PCKEN35

#endif

/*-------------------------------------------------------------------------
 *      CLK bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CLK_CKDIVR_CKM      0x07

#define MASK_CLK_CRTCR_RTCSWBSY  0x01
#define MASK_CLK_CRTCR_RTCSEL0   0x02
#define MASK_CLK_CRTCR_RTCSEL1   0x04
#define MASK_CLK_CRTCR_RTCSEL2   0x08
#define MASK_CLK_CRTCR_RTCSEL3   0x10
#define MASK_CLK_CRTCR_RTCDIV0   0x20
#define MASK_CLK_CRTCR_RTCDIV1   0x40
#define MASK_CLK_CRTCR_RTCDIV2   0x80

#define MASK_CLK_ICKCR_HSION     0x01
#define MASK_CLK_ICKCR_HSIRDY    0x02
#define MASK_CLK_ICKCR_LSION     0x04
#define MASK_CLK_ICKCR_LSIRDY    0x08
#define MASK_CLK_ICKCR_SAHALT    0x10
#define MASK_CLK_ICKCR_FHWU      0x20
#define MASK_CLK_ICKCR_BEEPAHALT 0x40

#define MASK_CLK_PCKENR1_PCKEN10 0x01
#define MASK_CLK_PCKENR1_PCKEN11 0x02
#define MASK_CLK_PCKENR1_PCKEN12 0x04
#define MASK_CLK_PCKENR1_PCKEN13 0x08
#define MASK_CLK_PCKENR1_PCKEN14 0x10
#define MASK_CLK_PCKENR1_PCKEN15 0x20
#define MASK_CLK_PCKENR1_PCKEN16 0x40
#define MASK_CLK_PCKENR1_PCKEN17 0x80

#define MASK_CLK_PCKENR2_PCKEN20 0x01
#define MASK_CLK_PCKENR2_PCKEN21 0x02
#define MASK_CLK_PCKENR2_PCKEN22 0x04
#define MASK_CLK_PCKENR2_PCKEN23 0x08
#define MASK_CLK_PCKENR2_PCKEN24 0x10
#define MASK_CLK_PCKENR2_PCKEN25 0x20
#define MASK_CLK_PCKENR2_PCKEN27 0x80

#define MASK_CLK_CCOR_CCOSWBSY   0x01
#define MASK_CLK_CCOR_CCOSEL     0x1E
#define MASK_CLK_CCOR_CCODIV     0xE0

#define MASK_CLK_ECKCR_HSEON     0x01
#define MASK_CLK_ECKCR_HSERDY    0x02
#define MASK_CLK_ECKCR_LSEON     0x04
#define MASK_CLK_ECKCR_LSERDY    0x08
#define MASK_CLK_ECKCR_HSEBYP    0x10
#define MASK_CLK_ECKCR_LSEBYP    0x20

#define MASK_CLK_SWCR_SWBSY      0x01
#define MASK_CLK_SWCR_SWEN       0x02
#define MASK_CLK_SWCR_SWIEN      0x04
#define MASK_CLK_SWCR_SWIF       0x08

#define MASK_CLK_CSSR_CSSEN      0x01
#define MASK_CLK_CSSR_AUX        0x02
#define MASK_CLK_CSSR_CSSDIE     0x04
#define MASK_CLK_CSSR_CSSD       0x08
#define MASK_CLK_CSSR_CSSDGON    0x10

#define MASK_CLK_CBEEPR_BEEPSWBSY 0x01
#define MASK_CLK_CBEEPR_CLKBEEPSEL0 0x02
#define MASK_CLK_CBEEPR_CLKBEEPSEL1 0x04

#define MASK_CLK_REGCSR_REGREADY 0x01
#define MASK_CLK_REGCSR_REGOFF   0x02
#define MASK_CLK_REGCSR_HSIPD    0x04
#define MASK_CLK_REGCSR_LSIPD    0x08
#define MASK_CLK_REGCSR_HSEPD    0x10
#define MASK_CLK_REGCSR_LSEPD    0x20
#define MASK_CLK_REGCSR_EEBUSY   0x40
#define MASK_CLK_REGCSR_EEREADY  0x80

#define MASK_CLK_PCKENR3_PCKEN30 0x01
#define MASK_CLK_PCKENR3_PCKEN31 0x02
#define MASK_CLK_PCKENR3_PCKEN32 0x04
#define MASK_CLK_PCKENR3_PCKEN33 0x08
#define MASK_CLK_PCKENR3_PCKEN34 0x10
#define MASK_CLK_PCKENR3_PCKEN35 0x20


/*-------------------------------------------------------------------------
 *      WWDG register definitions
 *-----------------------------------------------------------------------*/
/* WWDG control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char T0          : 1;
  unsigned char T1          : 1;
  unsigned char T2          : 1;
  unsigned char T3          : 1;
  unsigned char T4          : 1;
  unsigned char T5          : 1;
  unsigned char T6          : 1;
  unsigned char T7          : 1;
} __BITS_WWDG_CR;
#endif
__IO_REG8_BIT(WWDG_CR,     0x50D3, __READ_WRITE, __BITS_WWDG_CR);

/* WWDR window register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char W0          : 1;
  unsigned char W1          : 1;
  unsigned char W2          : 1;
  unsigned char W3          : 1;
  unsigned char W4          : 1;
  unsigned char W5          : 1;
  unsigned char W6          : 1;
  unsigned char W7          : 1;
} __BITS_WWDG_WR;
#endif
__IO_REG8_BIT(WWDG_WR,     0x50D4, __READ_WRITE, __BITS_WWDG_WR);


/*-------------------------------------------------------------------------
 *      WWDG bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

